lyusupov/SoftRF/software/firmware/source/libraries/LibAPRS_ESP32/AFSK.cpp
    //// Alternative using 5 bits ////////////////
    uint8_t bits = afsk->sampledBits & 0x1f;
    uint8_t c = CountOnesFromInteger(bits);
    if (c >= 3)
      afsk->actualBits |= 1;
    /////////////////////////////////////////////////

    // Now we can pass the actual bit to the HDLC parser.
    // We are using NRZ coding, so if 2 consecutive bits
    // have the same value, we have a 1, otherwise a 0.
    // We use the TRANSITION_FOUND function to determine this.
    //
    // This is smart in combination with bit stuffing,
    // since it ensures a transmitter will never send more
    // than five consecutive 1's. When sending consecutive
    // ones, the signal stays at the same level, and if
    // this happens for longer periods of time, we would
    // not be able to synchronize our phase to the transmitter
    // and would start experiencing "bit slip".
    //
    // By combining bit-stuffing with NRZ coding, we ensure
    // that the signal will regularly make transitions
    // that we can use to synchronize our phase.
    //
    // We also check the return of the Link Control parser
    // to check if an error occured.

    if (!hdlcParse(&afsk->hdlc, !TRANSITION_FOUND(afsk->actualBits), &afsk->rxFifo))
    {
      afsk->status |= 1;
      if (fifo_isfull(&afsk->rxFifo))
      {
        fifo_flush(&afsk->rxFifo);
        afsk->status = 0;
#ifdef DEBUG_TNC
        Serial.println("FIFO IS FULL");
#endif
      }
    }
  }
}

#define ADC_SAMPLES_COUNT 768
int16_t abufPos = 0;
// extern TaskHandle_t taskSensorHandle;

extern void APRS_poll();
uint8_t poll_timer = 0;
// int adc_count = 0;
int offset_new = 0, offset = 2303, offset_count = 0;

#if !defined(I2S_INTERNAL) && defined(ESP32)
// int x=0;
portMUX_TYPE DRAM_ATTR timerMux = portMUX_INITIALIZER_UNLOCKED;

bool sqlActive = false;

void IRAM_ATTR sample_isr()
{
  // portENTER_CRITICAL_ISR(&timerMux); // ISR start

  if (hw_afsk_dac_isr)
  {
    uint8_t sinwave = AFSK_dac_isr(AFSK_modem);
    //   abufPos += 45;
    // sinwave =(uint8_t)(127+(sin((float)abufPos/57)*128));
    // if(abufPos>=315) abufPos=0;
    // if(x++<16) Serial.printf("%d,",sinwave);
    dacWrite(MIC_PIN, sinwave);
    if (AFSK_modem->sending == false) {
      if (PTT_PIN > 0) {
        digitalWrite(PTT_PIN, HIGH);
      }
    }
  }
  else
  {
#ifdef SQL
    if (digitalRead(34) == LOW)
    {
      if (sqlActive == false)
      { // Falling Edge SQL
        log_d("RX Signal");
        sqlActive = true;
      }
#endif
      // digitalWrite(4, HIGH);
      adcVal = adc1_get_raw(SPK_PIN); // Read ADC1_0 From PIN 36(VP)
      // Auto offset level
      offset_new += adcVal;
      offset_count++;
      if (offset_count >= 192)
      {
        offset = offset_new / offset_count;
        offset_count = 0;
        offset_new = 0;
        if (offset > 3300 || offset < 1300) // Over dc offset to default
          offset = 2303;
      }
      // Convert unsign wave to sign wave form
      adcVal -= offset;
      // adcVal-=2030;
      int8_t adcR = (int8_t)((int16_t)(adcVal >> 4)); // Reduce 12bit to 8bit
      // int8_t adcR = (int8_t)(adcVal / 16); // Reduce 12bit to 8bit
      adcq.push(&adcR); // Add queue buffer
// digitalWrite(4, LOW);
#ifdef SQL
    }
    else
    {
      if (sqlActive == true)
      { // Falling Edge SQL
        log_d("End Signal");
        sqlActive = false;
      }
    }
#endif
  }
  // portEXIT_CRITICAL_ISR(&timerMux); // ISR end
}
#else
bool tx_en = false;
#endif /* I2S_INTERNAL */

extern int mVrms;
extern float dBV;
extern bool afskSync;

long mVsum = 0;
int mVsumCount = 0;
long lastVrms = 0;
bool VrmsFlag = false;
bool sqlActive = false;

void AFSK_Poll(bool SA818, bool RFPower, uint8_t powerPin)
{
  int mV;
  int x = 0;
  // uint8_t sintable[8] = {127, 217, 254, 217, 127, 36, 0, 36};
#ifdef I2S_INTERNAL
  size_t bytesRead;
  uint16_t pcm_in[ADC_SAMPLES_COUNT];
  uint16_t pcm_out[ADC_SAMPLES_COUNT];
#else
  int8_t adc;
#endif

  if (hw_afsk_dac_isr)
  {
#if defined(I2S_INTERNAL)
    memset(pcm_out, 0, sizeof(pcm_out));
    for (x = 0; x < ADC_SAMPLES_COUNT; x++)
    {
      // LED_RX_ON();
      adcVal = (int)AFSK_dac_isr(AFSK_modem);
      //  Serial.print(adcVal,HEX);
      //  Serial.print(",");
      if (AFSK_modem->sending == false && adcVal == 0)
        break;

      // float adcF = hp_filter.Update((float)adcVal);
      // adcVal = (int)adcF;
      // Ref: https://lang-ship.com/blog/work/esp32-i2s-dac/#toc6
      // Left Channel GPIO 26
      pcm_out[x] = (uint16_t)adcVal; // MSB
      if(SA818){
        pcm_out[x] <<= 7;
        pcm_out[x] += 10000;
      }
      else
      {
        pcm_out[x] <<= 8;
      }
      x++;
      // Right Channel GPIO 25
      pcm_out[x] = 0;
    }

    size_t writeByte;
    if (x > 0)
    {
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=4
      if (i2s_write(I2S_NUM_0, (char *)&pcm_out, (x * sizeof(uint16_t)),&writeByte, portMAX_DELAY) != ESP_OK)
#else
      if (i2s_write_bytes(I2S_NUM_0, (char *)&pcm_out, (x * sizeof(uint16_t)), portMAX_DELAY) == ESP_FAIL)
#endif
      {
        Serial.println("I2S Write Error");
      }
    }
    // size_t writeByte;
    // int availableBytes = x * sizeof(uint16_t);
    // int buffer_position = 0;
    // size_t bytesWritten = 0;
    // if (x > 0)
    // {
    //   do
    //   {

    //     // do we have something to write?
    //     if (availableBytes > 0)
    //     {
    //       // write data to the i2s peripheral
    //       i2s_write(I2S_NUM_0, buffer_position + (char *)&pcm_out,availableBytes, &bytesWritten, portMAX_DELAY);
    //       availableBytes -= bytesWritten;
    //       buffer_position += bytesWritten;
    //     }
    //     delay(bytesWritten);
    //   } while (bytesWritten > 0);
    // }

    // Wait for the I2S DAC to pass all buffers before turning the DAC/PTT off.
    if (AFSK_modem->sending == false)
    {
      int txEvents = 0;
      memset(pcm_out, 0, sizeof(pcm_out));
      // Serial.println("TX TAIL");
      //  Clear Delay DMA Buffer
      size_t writeByte;
      for (int i = 0; i < 5; i++)
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=4
        i2s_write(I2S_NUM_0, (char *)&pcm_out, (ADC_SAMPLES_COUNT * sizeof(uint16_t)),&writeByte, portMAX_DELAY);
#else
        i2s_write_bytes(I2S_NUM_0, (char *)&pcm_out, (ADC_SAMPLES_COUNT * sizeof(uint16_t)), portMAX_DELAY);
#endif
      // wait on I2S event queue until a TX_DONE is found
      while (xQueueReceive(i2s_event_queue, &i2s_evt, portMAX_DELAY) == pdPASS)
      {
        if (i2s_evt.type == I2S_EVENT_TX_DONE) // I2S DMA finish sent 1 buffer
        {
          if (++txEvents > 6)
          {
            // Serial.println("TX DONE");
            break;
          }
          delay(10);
        }
      }
#if defined(CONFIG_IDF_TARGET_ESP32)
      dac_i2s_disable();
#endif /* CONFIG_IDF_TARGET_ESP32 */
      i2s_zero_dma_buffer(I2S_NUM_0);
      // i2s_adc_enable(I2S_NUM_0);
      if (PTT_PIN > 0) {
        digitalWrite(PTT_PIN, HIGH);
      }
      if (SA818) {
        digitalWrite(powerPin, RFPower ? HIGH : LOW); //RF Power LOW
      }
    }
#endif /* I2S_INTERNAL */
  }
  else
  {
#ifdef I2S_INTERNAL
#ifdef SQL
    if (digitalRead(33) == LOW)
    {
      if (sqlActive == false)
      { // Falling Edge SQL
        log_d("RX Signal");
        sqlActive = true;
        mVsum = 0;
        mVsumCount = 0;
      }
#endif
#if defined(CONFIG_IDF_TARGET_ESP32)
      // if (i2s_read(I2S_NUM_0, (char *)&pcm_in, (ADC_SAMPLES_COUNT * sizeof(uint16_t)), &bytesRead, portMAX_DELAY) == ESP_OK)
      if (i2s_read(I2S_NUM_0, (char *)&pcm_in, (ADC_SAMPLES_COUNT * sizeof(uint16_t)), &bytesRead, portMAX_DELAY) == ESP_OK)
      {
        // log_d("%i,%i,%i,%i", pcm_in[0], pcm_in[1], pcm_in[2], pcm_in[3]);
        for (int i = 0; i < (bytesRead / sizeof(uint16_t)); i += 2)
        {
          adcVal = (int)pcm_in[i];
          offset_new += adcVal;
          offset_count++;
          if (offset_count >= ADC_SAMPLES_COUNT) // 192
          {
            offset = offset_new / offset_count;
            offset_count = 0;
            offset_new = 0;
            if (offset > 3300 || offset < 1300) // Over dc offset to default
              offset = 2303;
          }
          adcVal -= offset; // Convert unsinewave to sinewave

          if (afskSync == false)
          {
            mV = abs((int)adcVal);         // mVp-p
            mV = (int)((float)mV / 3.68F); // mV=(mV*625)/36848;
            mVsum += powl(mV, 2);
            mVsumCount++;
          }

          if (input_HPF)
          {
            adcVal = (int)filter(&bpf, (int16_t)adcVal);
          }

          int16_t adcR = (int16_t)(adcVal);

          AFSK_adc_isr(AFSK_modem, adcR); // Process signal IIR
          if (i % 32 == 0)
            APRS_poll(); // Poll check every 1 bit
        }
        // Get mVrms on Sync flage 0x7E
        if (afskSync == false)
        {
          if (hdlc_flag_count > 5 && hdlc_flage_end == true)
          {
            if (mVsumCount > 3840)
            {
              mVrms = sqrtl(mVsum / mVsumCount);
              mVsum = 0;
              mVsumCount = 0;
              lastVrms = millis() + 500;
              VrmsFlag = true;
              // if(millis()>lastVrms){
              //  double Vrms=(double)mVrms/1000;
              //  dBV = 20.0F * log10(Vrms);
              //  //dBu = 20 * log10(Vrms / 0.7746);
              //  Serial.printf("mVrms=%d dBV=%0.1f agc=%0.2f\n",mVrms,dBV);
              // afskSync = true;
              //}
            }
          }
          if (millis() > lastVrms && VrmsFlag)
          {
            afskSync = true;
            VrmsFlag = false;
          }
        }
      }
#else
    /* TBD */
#endif /* CONFIG_IDF_TARGET_ESP32 */
#else
    if (adcq.getCount() >= ADC_SAMPLES_COUNT)
    {
      for (x = 0; x < ADC_SAMPLES_COUNT; x++)
      {
        if (!adcq.pop(&adc)) // Pull queue buffer
          break;
        // audiof[x] = (float)adc;
        //  Serial.printf("%02x ", (unsigned char)adc);
        AFSK_adc_isr(AFSK_modem, adc); // Process signal IIR
        if (x % 4 == 0)
          APRS_poll(); // Poll check every 1 byte
      }
      APRS_poll();
    }
#endif
#ifdef SQL
    }
    else
    {
      // if(sqlActive==true){
      //   i2s_stop(I2S_NUM_0);
      // }
      hdlc_flag_count = 0;
      hdlc_flage_end = false;
      LED_RX_OFF();
      sqlActive = false;
    }
#endif
  }
}
